// *----------------------------------------------------------------------------
// * システム		:	共通
// * スクリプト		:	メッセージ
// * 会社名or所属名	:	株式会社ヴィクサス
// * 作成日			:	2006/03/03
// * 作成者			:	Hirata
// * *** 修正履歴 ***
// * No.	Date		Author		Description
// *----------------------------------------------------------------------------
var msgStr	=	new Array();
msgStr[ "F0000" ]	=	"エラーが有ります。";
msgStr[ "F0001" ]	=	"[&0]ファイルを指定して下さい。";
msgStr[ "F0002" ]	=	"ファイルの指定に誤りが有ります。（パスが指定されていません）";
msgStr[ "F0003" ]	=	"ファイルが存在しません。";
msgStr[ "F0004" ]	=	"拡張子が有りません。";
msgStr[ "F0005" ]	=	"半角英数字以外が入力されています。";
msgStr[ "F0006" ]	=	"数値では有りません。";
msgStr[ "F0007" ]	=	"整数では有りません。";
msgStr[ "F0008" ]	=	"[&0]以上を入力して下さい。";
msgStr[ "F0009" ]	=	"半角カナは入力できません。";
msgStr[ "F0010" ]	=	"使用禁止文字が入力されています。";
msgStr[ "F0011" ]	=	"[&0]文字を入力して下さい。";
msgStr[ "F0012" ]	=	"赤く表示される項目を入力して下さい。";
msgStr[ "F0013" ]	=	"[&0]の入力が重複しています。";
msgStr[ "F0014" ]	=	"入力値の大小関係が異常です。";
msgStr[ "F0015" ]	=	"[&0]の大小関係が異常です。";
msgStr[ "F0016" ]	=	"期間終了日は期間開始日以上を入力して下さい。";
msgStr[ "F0017" ]	=	"期間終了日は期間開始日より後の日付を入力して下さい。";
msgStr[ "F0018" ]	=	"全角カナ以外が入力されています。";
msgStr[ "F0019" ]	=	"[&0]文字以上が入力されています。";
msgStr[ "F0020" ]	=	"[&0]形式で入力して下さい。";
msgStr[ "F0021" ]	=	"年は[&0]〜[&1]の範囲で入力して下さい。";
msgStr[ "F0022" ]	=	"月は1〜12の範囲で入力して下さい。";
msgStr[ "F0023" ]	=	"日は1〜31の範囲で入力して下さい。";
msgStr[ "F0024" ]	=	"存在しない日付です。";
msgStr[ "F0025" ]	=	"閏年では有りません。";
msgStr[ "F0026" ]	=	"半角文字が入力されています。";
msgStr[ "F0027" ]	=	"半角カナ以外が入力されています。";
msgStr[ "F0028" ]	=	"半角文字以外が入力されています。";
msgStr[ "F0029" ]	=	"ｱ〜ﾝ、A〜Z、0〜9、半角記号（\"、'、,は除く）を入力して下さい。";
msgStr[ "F0030" ]	=	"A〜Z、0〜9、半角記号（\"、'、,は除く）を入力して下さい。";
msgStr[ "F0031" ]	=	"A〜Z、0〜9を入力して下さい。";
msgStr[ "F0032" ]	=	"半角英数カナ以外が入力されています。";
msgStr[ "F0033" ]	=	"数字以外が入力されています。";

msgStr[ "W0000" ]	=	"登録しました。";

msgStr[ "C0000" ]	=	"登録します。よろしいですか？";
msgStr[ "C0001" ]	=	"削除します。よろしいですか？";
