// *----------------------------------------------------------------------------
// * システム		:	共通
// * スクリプト		:	メッセージ（簡易チェック用）
// * 会社名or所属名	:	株式会社ヴィクサス
// * 作成日			:	2006/03/03
// * 作成者			:	Hirata
// * *** 修正履歴 ***
// * No.	Date		Author		Description
// *----------------------------------------------------------------------------
var msgStr	=	new Array();
msgStr[ "F0000" ]	=	"[&0]のファイルの指定に誤りが有ります。（パスが指定されていません）";
msgStr[ "F0001" ]	=	"[&0]のファイルが存在しません。";
msgStr[ "F0002" ]	=	"[&0]に拡張子が有りません。";
msgStr[ "F0003" ]	=	"[&0]に半角英数字以外が入力されています。";
msgStr[ "F0004" ]	=	"[&0]に数値以外が入力されています。";
msgStr[ "F0005" ]	=	"[&0]に半角カナは入力できません。";
msgStr[ "F0006" ]	=	"[&0]に使用禁止文字が入力されています。";
msgStr[ "F0007" ]	=	"[&0]に[&1]文字を入力して下さい。";
msgStr[ "F0008" ]	=	"[&0]を入力して下さい。";
msgStr[ "F0009" ]	=	"[&0]に全角カナ以外が入力されています。";
msgStr[ "F0010" ]	=	"[&0]に[&1]文字以上が入力されています。";
msgStr[ "F0011" ]	=	"[&0]は[&2]形式で入力して下さい。";
msgStr[ "F0012" ]	=	"[&0]の年は[&1]〜[&2]の範囲で入力して下さい。";
msgStr[ "F0013" ]	=	"[&0]の月は1〜12の範囲で入力して下さい。";
msgStr[ "F0014" ]	=	"[&0]の日は1〜31の範囲で入力して下さい。";
msgStr[ "F0015" ]	=	"[&0]の年は閏年では有りません。";
msgStr[ "F0016" ]	=	"[&0]に存在しない日付が入力されています。";
msgStr[ "F0017" ]	=	"[&0]に半角文字が入力されています。";
msgStr[ "F0018" ]	=	"[&0]に半角カナ以外が入力されています。";
msgStr[ "F0019" ]	=	"[&0]に半角文字以外が入力されています。";
msgStr[ "F0020" ]	=	"[&0]にｱ〜ﾝ、A〜Z、0〜9、半角記号（\"、'、,は除く）を入力して下さい。";
msgStr[ "F0021" ]	=	"[&0]にA〜Z、0〜9、半角記号（\"、'、,は除く）を入力して下さい。";
msgStr[ "F0022" ]	=	"[&0]にA〜Z、0〜9を入力して下さい。";
msgStr[ "F0023" ]	=	"[&0]に半角英数カナ以外が入力されています。";
msgStr[ "F0024" ]	=	"[&0]に数字以外が入力されています。";

msgStr[ "F0025" ]	=	"店案内週に開始週より大きい終了週が選択されています。";

msgStr[ "F0026" ]	=	"入力された利用者コードの利用者は存在しません。";
msgStr[ "F0027" ]	=	"利用者コードエラーが発生しました。\nローソンシステム部にご連絡下さい。";
msgStr[ "F0028" ]	=	"データがありません。";
msgStr[ "F0029" ]	=	"データベースにアクセスできません。\n再実行して下さい。";
msgStr[ "F0030" ]	=	"選択された条件のデータはありません。";
msgStr[ "F0031" ]	=	"件数が[&0]（最大件数）を超えました。検索条件を絞って下さい。";

msgStr[ "W0000" ]	=	"登録しました。";

msgStr[ "C0000" ]	=	"登録します。よろしいですか？";
msgStr[ "C0001" ]	=	"削除します。よろしいですか？";
