/**
*-------------------------------------------------------------------------------
* クラス名			AppConst.class
* システム名称		共通
* 名称				システム・定数クラス
* 会社名or所属名	株式会社ヴィクサス
* 作成日			2006/11/08 00:00:00
* @author			Y.Takabayashi
* @since			1.0
* @version			1.0
* *** 修正履歴 ***
* No. Date			Author		Description
*-------------------------------------------------------------------------------
*/
package app;

public class AppConst {
	/**
	 * 連番 サービス時間チェックしない
	 */
	public static final String RENBAN_NT_CHK_SRVC_TM	= "999999";
}		// *********************** End of Class  ***********************************
